replication/certificate/mutants/M1-weight-loses-the-parity-term.patch
--- noh_wt_certificate.rs	2026-08-20 22:48:31.261980829 -0400
+++ noh_wt_certificate.rs	2026-08-20 22:48:31.261997247 -0400
@@ -181,7 +181,7 @@
     if k <= 3 {
         0
     } else {
-        i64::try_from((k - 1) / 3 + k % 2).expect("weight fits in i64")
+        i64::try_from((k - 1) / 3).expect("weight fits in i64")
     }
 }
 
