replication/certificate/mutants/M2-valuation-formula-off-by-one.patch
--- noh_wt_certificate.rs	2026-08-20 22:48:31.261980829 -0400
+++ noh_wt_certificate.rs	2026-08-20 22:48:31.263215070 -0400
@@ -173,7 +173,7 @@
         }
         s += v2_int(a) + v2_int(b);
     }
-    Some(s - 2 * i64::from(m) + s2(m))
+    Some(s - 2 * i64::from(m) + s2(m) + 1)
 }
 
 // ---------------------------------------------------------------- the weight
