replication/certificate/mutants/M3-jprime-odd-branch.patch
--- noh_wt_certificate.rs	2026-08-20 22:48:31.261980829 -0400
+++ noh_wt_certificate.rs	2026-08-20 22:48:31.264312407 -0400
@@ -102,7 +102,7 @@
     if k % 2 == 0 {
         k / 2
     } else {
-        i128::midpoint(k, e)
+        (k + 1) / 2
     }
 }
 
