replication/certificate/mutants/M6b-M6-with-ground-truth-deleted.patch
--- noh_wt_certificate.rs	2026-08-20 22:48:31.261980829 -0400
+++ noh_wt_certificate.rs	2026-08-20 22:48:31.268592308 -0400
@@ -113,7 +113,7 @@
     if k % 2 == 0 {
         let mut num = Rat::int(1);
         for i in 0..i128::from(m) {
-            num = num.mul(Rat::new(lam2.n - 4 * i * i * lam2.d, lam2.d));
+            num = num.mul(Rat::new(lam2.n - 16 * i * i * lam2.d, lam2.d));
         }
         let mut den = Rat::int(1);
         for i in 1..=(2 * i128::from(m)) {
@@ -150,7 +150,7 @@
         // even: a_{i+1} = a_i (lam^2 - 4 i^2) / ((2i+2)(2i+1))
         // odd : b_{i+1} = b_i (lam^2 - (2i+1)^2) / ((2i+3)(2i+2))
         let (sub, p, q) = if even {
-            (4 * i * i, 2 * i + 2, 2 * i + 1)
+            (16 * i * i, 2 * i + 2, 2 * i + 1)
         } else {
             ((2 * i + 1) * (2 * i + 1), 2 * i + 3, 2 * i + 2)
         };
@@ -166,7 +166,7 @@
 fn v2_closed(k: i128, m: u32, e: i128) -> Option<i64> {
     let mut s = 0i64;
     for i in 0..i128::from(m) {
-        let xi = if k % 2 == 0 { 2 * i } else { 2 * i + 1 };
+        let xi = if k % 2 == 0 { 4 * i } else { 2 * i + 1 };
         let (a, b) = (k - e * xi, k + e * xi);
         if a == 0 || b == 0 {
             return None;
@@ -215,39 +215,6 @@
     );
     println!("[1] closed form == ODE recurrence on {pairs} (k,m) pairs");
 
-    // ground truth recomputed by workstream 01 (01-kmu-extraction.md section 6b)
-    check!(
-        jprime(3, E) == 3 && c_closed(3, 0, E) == Rat::int(1),
-        "U_2(t^-3) != t^-3"
-    );
-    check!(
-        c_closed(3, 1, E) == Rat::int(0),
-        "U_2(t^-3) has a second term"
-    );
-    check!(
-        jprime(6, E) == 3 && c_closed(6, 0, E) == Rat::int(1) && c_closed(6, 1, E) == Rat::int(2),
-        "U_2(t^-6) != t^-3 + 2 t^-6"
-    );
-    check!(
-        c_closed(6, 2, E) == Rat::int(0),
-        "U_2(t^-6) has a third term"
-    );
-    check!(
-        c_closed(5, 0, E) == Rat::new(5, 3)
-            && c_closed(5, 1, E) == Rat::new(40, 81)
-            && c_closed(5, 2, E) == Rat::new(-112, 729),
-        "U_2(t^-5) ground truth mismatch"
-    );
-    check!(
-        c_closed(4, 0, E) == Rat::int(1)
-            && c_closed(4, 1, E) == Rat::new(8, 9)
-            && c_closed(4, 2, E) == Rat::new(-40, 243),
-        "U_2(t^-4) ground truth mismatch"
-    );
-    check!(
-        c_closed(8, 1, E) == Rat::new(32, 9) && c_closed(7, 1, E) == Rat::new(140, 81),
-        "U_2(t^-7)/U_2(t^-8) ground truth mismatch"
-    );
     println!("[1] ground-truth rows U_2(t^-3), t^-4, t^-5, t^-6, t^-7, t^-8 reproduced");
 
     // 2. valuation identity
